Tekla Open API Reference for Tekla Structures 2025
Vector.Multiply Operator
Overload List
Name | Description
Multiply(Double, Vector)
 Calculates the multiplication of the given vector with the given scalar.
Multiply(Vector, Double)
 Calculates the multiplication of the given vector with the given scalar.
Top
See Also
Reference
Vector Class
Tekla.Structures.Geometry3d Namespace